Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: བརྩོན་འགྲུས་དེ་ནི་གང་ལྟ་བར་མི་བྱེད་པ་དང་རྣམ་པར་ལྟ་བར་མི་བྱེད་པའོ། །
en: Diligence neither views nor beholds.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ཞི་བར་མི་བྱེད་པ་དང་རབ་ཏུ་འབར་བར་མི་བྱེད་པའོ། །
en: Diligence neither pacifies nor blazes.

source: བརྩོན་འགྲུས་དེ་ནི་གང་སྲུང་བར་མི་བྱེད་པ་དང་སྲུང་བ་དང་བྲལ་བ་མ་ཡིན་པའོ། །
en: Diligence neither guards nor does not guard.

source: བརྩོན་འགྲུས་དེ་ནི་གང་ཀུན་ཏུ་མི་འོང་བ་དང་འོང་བ་དང་བྲལ་བ་མ་ཡིན་པའོ། །
en: Diligence does not arrive, nor does it not arrive.’

source: བློ་གྲོས་རྒྱ་མཚོ་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་འབར་བས། །བརྩོན་འགྲུས་དང་རབ་ཏུ་ལྡན་པའི་གཏམ་འདི་དག་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་པ་ན་སྲོག་ཆགས་ཁྲིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: “Sāgaramati, when the blessed thus-gone Dīptavīrya gave extensive teachings on diligence, ten thousand beings attained the acceptance that phenomena are unborn.

source: བྱང་ཆུབ་སེམས་དཔའ་གོ་ཆ་སྲ་བས་བཅོམ་ལྡན་འདས་དེ་ལས་བརྩོན་འགྲུས་བསྟན་པ་དེ་ཐོས་ནས་དགེ་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་ཏེ། བརྩོན་འགྲུས་བརྩམས་ནས་གནས་པར་གྱུར་ཏོ། །
en: Having heard this teaching on diligence, the bodhisattva Solid Armor pursued virtuous qualities and practiced diligence.

source: དེ་བརྩོན་འགྲུས་བརྩམས་ཏེ་གཅེས་པ་མ་བོར་བར་ལོ་བྱེ་བ་འདས་པ་དང་ཆུང་ངུའི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་རབ་ཏུ་ཐོབ་བོ། །
en: Practicing diligence, ten million years passed without him giving up his dedication, whereupon he attained the lesser level of acceptance.

source: དེ་བརྩོན་འགྲུས་བརྩམས་ཏེ་དགེ་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པས་འདུག་བཞིན་དུ་འཆི་བའི་དུས་བྱས་སོ། །
en: Practicing diligence, he exerted himself in the pursuit of virtue, and while doing so, he passed away.

source: དེ་ཤི་འཕོས་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་ཀྱི་སྤྱན་སྔར་བརྫུས་ཏེ་སྐྱེས་པར་གྱུར་ནས་དེས་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་ལས་འདུས་པ་ཆེན་པོའི་ལེའུ་ཡི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་པར་གྱུར་ཏོ། །
en: Dying and transmigrating, he was miraculously born in the presence of that very Thus-Gone One and heard this condensed Dharma teaching from him.

source: དེ་ཡང་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པས་འདུག་བཞིན་དུ་འཆི་བའི་དུས་བྱས་པར་གྱུར་ཏོ། །
en: Thus, he diligently sought the Dharma and while doing so, he passed away.

source: བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་དེས་རྣམ་གྲངས་འདིས་སངས་རྒྱས་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་མཉེས་པར་བྱེད་ཅིང་། གང་དག་བསྐལ་པ་མེ་ཏོག་གི་འབྱུང་གནས་དེ་ལ་བྱུང་བ་ཐམས་ཅད་ལས་བརྩོན་འགྲུས་བརྩམས་ཏེ
en: Sāgaramati, this bodhisattva pleased eighty-four thousand buddhas with this teaching and used everything that occurred in the Flower Origin eon to practice diligence.

source: དགེ་བའི་ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པར་གྱུར་ནས་འདུག་བཞིན་དུ་འཆི་བའི་དུས་བྱས་པར་གྱུར་ཏོ། །
en: Thus, he diligently sought virtuous qualities and while doing so, he passed away.

source: བློ་གྲོས་རྒྱ་མཚོ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གོ་ཆ་སྲ་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་
en: “Sāgaramati, you should not think that the bodhisattva Solid Armor is someone unknown to you.

source: སྙམ་དུ་ཁྱོད་སོམ་ཉིའམ་ཡིད་གཉིས་སམ་ཐེ་ཚོམ་ཟ་བར་གྱུར་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: If you are uncertain, vacillating, or doubtful, do not think that way.

source: བློ་གྲོས་རྒྱ་མཚོ་ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གོ་ཆ་སྲ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Sāgaramati, it was I who was at that time the bodhisattva Solid Armor.

source: བློ་གྲོས་རྒྱ་མཚོ་ངས་བརྩོན་འགྲུས་འདི་འདྲ་བས་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དག་ཕྱིར་བསྙིལ་ཏོ། །
en: Sāgaramati, by putting forth this quality of effort, I distinguished myself from hundreds of thousands of other bodhisattvas.

source: བློ་གྲོས་རྒྱ་མཚོ་ངས་དེ་ཙམ་དུ་བརྩོན་འགྲུས་བརྩམས་པ་དེ་ལྟ་བུ་དེ་དང་ཚེགས་དེ་ལྟ་བུས། བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལ་ལྟོས། གང་དག་ལེ་ལོ་ཅན་དང་བརྩོན་འགྲུས་དམན་པར་གྱུར་པ་རྣམས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Sāgaramati, if it took me such effort and that much hardship to awaken to buddhahood, what can be said about those who are lazy and have weak diligence?

source: དེ་དག་ལ་བྱང་ཆུབ་ཡོད་པར་ག་ལ་འགྱུར་ཏེ་དེ་དག་ལ་བྱང་ཆུབ་ཤིན་ཏུ་རིང་ཞིང་རྣམ་པར་རིང་ངོ་། །
en: How could they gain awakening? They are far, very far from it.

source: བློ་གྲོས་རྒྱ་མཚོ་བསྟན་པ་འདི་ལ་བརྩོན་འགྲུས་བརྩམས་པ་ནི་དག་པར་འགྱུར་གྱི་ལེ་ལོ་ཅན་ནི་མ་ཡིན་ནོ། །
en: Sāgaramati, the point of this anecdote is that practicing diligence brings purification, being lazy does not.

source: བློ་གྲོས་རྒྱ་མཚོ་རྣམ་གྲངས་དེས་ན་འདི་ལྟར་གང་ལ་བརྩོན་འགྲུས་དང་བག་ཡོད་པ་དེ་ལ་བྱང་ཆུབ་ཡོད་པར་རིག་པར་བྱའོ། །
en: Sāgaramati, one should understand from this anecdote that where there is diligence and carefulness, there will be awakening.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བརྩོན་འགྲུས་དང་རབ་ཏུ་ལྡན་པའི་སྔོན་བྱུང་བའི་ལེའུ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: When the Blessed One had related this story from the past, expressing the meaning of diligence, five thousand bodhisattvas gained acceptance that phenomena are unborn.

source: ལྷ་དང་མིའི་སྐྱེ་དགུའི་སྲོག་ཆགས་བདུན་སྟོང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Seven thousand gods and human beings developed the mind directed toward unsurpassed and perfect awakening.

source: ངས་དྲན་སྔ་མ་འདས་པའི་དུས་ན་ནི། །བསྐལ་པ་མེ་ཏོག་འབྱུང་གནས་བལྟ་སྡུག་ལ། །ཤིན་ཏུ་རྣམ་བལྟས་འཇིག་རྟེན་ཁམས་མཆོག་ཏུ། །བརྩོན་འགྲུས་འབར་བའི་བདེ་བར་གཤེགས་པ་བྱུང་། །
en: “I recall that in the past, In the Flower Source eon—a time beautiful to behold— In the supreme world, Astounding Sight, There was the blissful Dīptavīrya.

source: བསྐལ་པ་དེ་ལ་རྒྱལ་བ་གང་བྱུང་བ། །དེ་དག་བརྒྱད་ཁྲི་བཞི་སྟོང་ཐམ་པའོ། །
en: “He was the last of eighty-four thousand Victors to appear in that eon.

source: འཇིག་རྟེན་ཁམས་ནི་དགའ་ལྡན་གནས་འདྲ་སྟེ། །
en: His world was like the Heaven of Joy, Replete with food and drink at one’s wish.

source: མི་ཡི་བཟའ་དང་བཏུང་བ་བསམས་པས་འབྱོར། །བུད་མེད་ཡོད་མིན་མངལ་ན་གནས་པ་མིན། །
en: “There were no women, nor time spent in the womb.

source: སེམས་ཅན་ཐམས་ཅད་བརྫུས་ཏེ་སྐྱེ་བར་གྱུར། །
en: All the beings there were born miraculously.

source: ཐེག་པ་དམན་པ་གྲགས་པར་མ་གྱུར་ཏེ། །
en: The Lesser Vehicle was unheard of.

source: ཐམས་ཅད་བདག་ཉིད་ཆེ་བའི་ཐེག་ཆེན་ཞུགས། །
en: Everyone entered the Great Vehicle of superior beings.

source: ཤིན་ཏུ་རྣམ་བལྟས་འཇིག་རྟེན་ཁམས་བལྟའི་ཕྱིར། །
en: To behold Astounding Sight.

source: བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུ་ནས་ལྷགས་པ། །
en: “Bodhisattvas came from all directions

source: དེ་དག་དགའ་བའི་རྣམ་པའི་ཏིང་འཛིན་ཐོབ། །སྔོན་ཆད་མ་མཐོང་བ་ཡི་བདེ་བ་མྱོང་། །
en: They all received the absorption of joyful appearance, Experiencing a novel form of bliss.

source: རྐང་གཉིས་ཀྱི་ནི་ཚོགས་གྱུར་གྲགས་ཆེན་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་རྩ་དྲུག་ཡོད། །
en: “This famous assembly Comprised 360 million humans

source: གཞན་ཡང་ལྷ་དང་མི་ནི་མང་པོ་དག །སངས་རྒྱས་ཐེག་པ་མཆོག་ལ་ཞུགས་པར་གྱུར། །
en: And many other humans and gods, Who had entered the supreme buddha vehicle.

source: ཡོན་ཏན་ཡེ་ཤེས་རྒྱ་མཚོ་དྲང་སྲོང་ཆེ། །དེ་ནི་བརྩོན་འགྲུས་བསྔགས་པ་ཡང་ཡང་བརྗོད། །
en: “The great sage who was an ocean of wisdom qualities Repeatedly sang the praises of diligence.

source: དེ་ནས་བརྩོན་འགྲུས་བརྟན་པ་མཁས་པ་དེ། །ལངས་ནས་དོན་འདི་ཉིད་ནི་རྒྱལ་ལ་ཞུས། །
en: Then he, learned and steeped in diligence, Arose and asked of the Victor this question:

source: བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་གྱུར་པ། །ཇི་ཙམ་གྱིས་ནི་བརྩོན་འགྲུས་སྟོབས་ལ་གནས། །
en: “ ‘How do bodhisattvas practicing diligence Come to maintain the power of diligence?

source: དེ་དོན་བཅོམ་ལྡན་བདག་ལ་བཤད་དུ་གསོལ། །བདག་ནི་དེ་ལ་རབ་ཏུ་ནན་ཏན་བགྱིད། །
en: Explain this point to me, O Blessed One, And I will earnestly apply it.’

source: དེ་ཡི་བསམ་པ་མཁྱེན་ནས་ཆོས་རྗེ་དེས། །བརྩོན་འགྲུས་ལས་བརྩམས་ཡོན་ཏན་རབ་གསུངས་པ། །
en: “The Dharma Lord understood his intention, And taught the qualities that come through diligence:

source: རྩོམ་པ་དང་ནི་དེ་བཞིན་རྟུལ་བ་དང་། །རྟག་ཏུ་སོ་སོར་རྟོག་དང་སྒྲུབ་པའོ། །
en: Endeavor, commitment, Contemplation, and accomplishment.

source: རྩོམ་པ་དེ་ནི་བྱང་ཆུབ་སེམས་ཞེས་བྱ། །
en: “ ‘Endeavor,’ he said, ‘is the mind of awakening.

source: རྟུལ་བ་དགེ་བ་སྟོང་དག་སྒྲུབ་བྱེད་པ། །
en: Commitment, accomplishing thousands of virtues.

source: སོ་སོར་རྟོག་པ་སེམས་ཅན་ཕན་པའི་དངོས། །
en: Contemplation, the means of benefiting beings.

source: སྒྲུབ་པ་དེ་བྱེད་ཆོས་ལ་བཟོད་པ་ཡིན། །
en: Accomplishment, accepting the Dharma that brings this about.

source: རྩོམ་པ་གུས་པར་བྱས་ཏེ་ཐོས་ཚོལ་བ། །
en: “ ‘Endeavor is respectfully seeking learning.

source: རྟུལ་བ་བརྟན་པ་ཡང་དག་སྟོན་བྱེད་པ། །
en: Commitment, to teach properly.

source: སོ་སོར་རྟོག་པ་འདི་ནི་ཚུལ་བཞིན་བརྗོད། །
en: Contemplation, speaking appropriately.

source: སྒྲུབ་པ་གང་ཚེ་ཡང་དག་ལྟ་སྐྱེ་བ། །
en: Accomplishment, the correct view.

source: རྩོམ་པ་སེར་སྣའི་དྲི་མ་སེལ་བ་ཡིན། །
en: “ ‘Endeavor is eliminating the stain of stinginess.

source: རྟུལ་བ་བདོག་པ་ཐམས་ཅད་ཡོངས་གཏོང་བ། །
en: Commitment, giving up all possessions.

source: སོ་སོར་རྟོག་པ་རྫོགས་པའི་བྱང་ཆུབ་སེམས། །
en: Contemplation, the mind of perfect awakening.

source: སྒྲུབ་པ་གང་ཚེ་རྣམ་སྨིན་མི་རེ་བ། །
en: Accomplishment, not hoping for ripening.

source: རྩོམ་པ་གཏོང་བ་ཆེན་པོ་གང་བསྒྲུབས་པ། །
en: “ ‘Endeavor is accomplishing great giving.

source: རྟུལ་བ་སློང་བ་རྣམས་ལ་བྱམས་བྱེད་པ། །
en: Commitment, being loving toward beggars.

source: སོ་སོར་རྟོག་འདི་ལོངས་སྤྱོད་མི་རྟག་སྙམ། །
en: Contemplation, considering the impermanence of possessions.

source: སྒྲུབ་པ་བྱིན་ནས་གདུང་བ་མེད་པ་ཡིན། །
en: Accomplishment, being without regret after giving.

source: རྩོམ་པ་ཆོས་ཀྱིས་ལོངས་སྤྱོད་གང་ཚོལ་བ། །
en: “ ‘Endeavor is seeking out the wealth of Dharma.

source: རྟུལ་བ་དེ་ནི་འཚོ་བ་དག་པ་ཡིན། །
en: Commitment, having pure livelihood.

source: བདག་གིས་སྙིང་པོ་བླངས་སྙམ་སོ་སོར་རྟོག །
en: Contemplation, knowing that one is living meaningfully.

source: སྒྲུབ་པ་སྦྱིན་པ་སྦྱིན་པས་རློམ་སེམས་མེད། །
en: Accomplishment, not becoming proud about being generous.

source: རྩོམ་པ་འཆལ་བའི་ཚུལ་ཁྲིམས་དྲི་མ་སེལ། །
en: “ ‘Endeavor is eliminating the stain of corrupt discipline.

source: རྟུལ་བ་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་ཉམས་པ་མེད། །
en: Commitment, not letting up on discipline and asceticism.

source: ཚུལ་ཁྲིམས་འཆལ་པའི་སྦྱིན་བྱེད་སོ་སོར་རྟོག །
en: Contemplation, being generous with those with corrupted discipline.

source: སྒྲུབ་པ་གང་ཚེ་ཚུལ་ཁྲིམས་རློམ་སེམས་མེད། །
en: Accomplishment, to be disciplined but without pride.

source: རྩོམ་པ་དག་ནི་ཡོངས་སུ་དག་པ་སྟེ། །
en: “ ‘Endeavor is purity.

source: རྟུལ་བ་ལུས་ནི་ཡོངས་སུ་དག་པ་ཡིན། །
en: Commitment, purifying the body.

source: སོ་སོར་རྟོག་པ་གང་ཡིན་འདི་སེམས་དག །
en: Contemplation, purifying the mind.

source: སྒྲུབ་པ་གང་ཡིན་ཆོས་རྣམས་ཡོངས་སུ་དག །
en: Accomplishment, purifying phenomena.

source: རྩོམ་པ་གནོད་སེམས་གོ་སྐབས་མེད་པ་ཡིན། །
en: “ ‘Endeavor is giving malice no chance.

source: རྟུལ་བ་བཟོད་པའི་སྟོབས་ནི་ཉེ་བར་སྟོན། །
en: Commitment, showing the power of patience.

source: སོ་སོར་རྟོག་པ་བདག་དང་གཞན་སྲུང་བྱེད། །
en: Contemplation, protecting self and other.

source: སྒྲུབ་པ་གང་ཚེ་རློམ་སེམས་གང་མེད་པ། །
en: Accomplishment, never being proud.

source: རྩོམ་པ་གཤེ་ལ་རྟག་ཏུ་དད་བྱེད་པ། །
en: “ ‘Endeavor is keeping the faith when criticized.

source: རྟུལ་བ་དེ་དག་ཐག་རིང་སྤོང་བ་སྟེ། །
en: Commitment, completely disregarding criticism.

source: སོ་སོར་རྟོག་པ་ནང་ནི་ཞི་བ་ཡིན། །
en: Contemplation, inner peace.

source: སྒྲུབ་པ་བདག་དང་གཞན་དུ་དམིགས་པ་མེད། །
en: Accomplishment, apprehending neither self nor other.

source: རྩོམ་པ་ལེ་ལོའི་དྲི་མ་སེལ་བ་སྟེ། །
en: “ ‘Endeavor is eliminating the stain of laziness.

source: རྟུལ་བ་བརྩོན་འགྲུས་སྟོབས་དང་མཐུ་ཡིན་ནོ། །
en: Commitment, having the strength and might of diligence.

source: ལེ་ལོ་ཅན་དག་སྨིན་བྱེད་སོ་སོར་རྟོག །
en: Contemplation, ripening lazy beings.

source: དེ་བྱེད་ཆོས་ལ་བཟོད་པ་སྒྲུབ་པ་ཡིན། །
en: Accomplishment, accepting the things they do.

source: རྩོམ་པ་བྱ་བ་ཡང་དག་སྒྲུབ་བྱེད་པ། །
en: “ ‘Endeavor is accomplishing one’s tasks.

source: རྟུལ་བ་བྱ་བ་ཉམས་འོག་ཆུད་པར་བྱེད། །
en: Commitment, mastering one’s tasks.

source: ཐེག་པ་གཞན་ལ་མི་རེ་སོ་སོར་རྟོག །
en: Contemplation, not putting hope in other vehicles.

source: སྒྲུབ་པ་ལས་རྣམས་ཆུད་མི་གསོན་པ་ཡིན། །
en: Accomplishment, not wasting actions.

source: རྩོམ་པ་ཡང་དག་དྲན་དང་ཤེས་བཞིན་ཅན། །
en: “ ‘Endeavor is being mindful and aware.

source: རྟུལ་བ་ཆོས་རྟོགས་པ་ལ་འཇུག་པ་ཡིན། །
en: Commitment, penetrating the realization of the Dharma.

source: བློ་གྲོས་ཀུན་ཏུ་བསྲུངས་པ་སོ་སོར་རྟོག །
en: Contemplation, protecting one’s intelligence.

source: སྒྲུབ་པ་དེ་ལ་མོས་ཤིང་འགྱུར་བ་མེད། །
en: Accomplishment, constantly being motivated toward that.

source: རྩོམ་པ་རིག་པ་རྟུལ་བ་ཚུལ་ཡིན་ཏེ། །
en: “ ‘Endeavor is understanding; commitment, the way of discipline;

source: སོ་སོར་རྟོག་པ་དེ་ནི་ཆོས་སྒོ་ཡིན། །
en: Contemplation, the gateway to the Dharma;

source: སྒྲུབ་པ་དེ་ནི་འབྱུང་བ་རབ་ཏུ་ཤེས། །
en: Accomplishment, understanding their occurrence.

source: འདི་དག་བརྩོན་འགྲུས་བརྩམས་པའི་སྦྱོར་བ་ཡིན། །
en: These are the applications of diligence.

source: རྩོམ་པ་ཚིག་འབྲུ་ཀུན་ཏུ་འཛིན་པ་སྟེ། །
en: “ ‘Endeavor is mastering language.

source: རྟུལ་བ་བསྟན་པ་ཡང་དག་སྟོན་པར་བྱེད། །
en: Commitment, giving teachings.

source: སོ་སོར་རྟོག་པ་སྒྲ་ནི་སེལ་བྱེད་པ། །
en: Contemplation, eliminating sound.

source: སྒྲུབ་པ་ཆོས་རྣམས་བརྗོད་པ་མེད་པ་ཉིད། །
en: Accomplishment, the ineffability of phenomena.

source: རྩོམ་པ་དགེ་བའི་བཤེས་གཉེན་བསྟེན་པ་ཡིན། །
en: “ ‘Endeavor is relying on a spiritual friend.

source: རྟུལ་བ་སྡིག་པའི་གྲོགས་པོ་རྣམ་པར་སྤོང་། །
en: Commitment, abandoning evil companions.

source: ཐོས་ནས་ཆོས་ཉིད་ལ་ནི་སོ་སོར་རྟོག །
en: Contemplation, studying reality.

source: སྒྲུབ་པ་ཆོས་རྣམས་དང་ནི་འགལ་མི་བྱེད། །
en: Accomplishment, being free from contradictions in one’s qualities.

source: རྩོམ་པ་སངས་རྒྱས་བསྟན་ལ་རབ་ཏུ་འབྱུང་། །
en: “ ‘Endeavor is to go forth into the Buddha’s teachings.

source: རྟུལ་བ་དགའ་བ་ཐམས་ཅད་སྤོང་བ་ཡིན། །
en: Commitment, discarding all joys.

source: དགེ་ལ་གནས་པ་གང་ཡིན་སོ་སོར་རྟོག །
en: Contemplation, living a life of virtue.

source: ཆོས་རྣམས་འགལ་བ་མེད་པ་སྒྲུབ་པ་ཡིན། །
en: Accomplishment, not contradicting the teachings.

source: རྩོམ་པ་དགོན་པར་དགའ་བ་གང་ཐོབ་པ། །
en: “ ‘Endeavor is achieving joy in remote areas.

source: རྟུལ་བ་འདུ་འཛི་རྣམ་པར་སྤོང་བ་ཡིན། །
en: Commitment, discarding distractions.

source: དབེན་པར་གནས་པར་དགའ་བ་སོ་སོར་རྟོག །
en: Contemplation, delighting in solitude.

source: སྒྲུབ་པ་གང་ཡིན་ཉོན་མོངས་མེད་པར་གནས། །
en: Accomplishment, living without afflictions.

source: རྩོམ་པ་འདོད་པ་ཆུང་ཞིང་བཀའ་བློ་བདེ། །
en: “ ‘Endeavor is having few desires and accepting advice.

source: རྟུལ་བ་དེ་ནི་ཆོག་ཤེས་གྱུར་པ་ཡིན། །
en: Commitment, being content.

source: དེས་པར་གང་གྱུར་དེ་ནི་སོ་སོར་རྟོག །
en: Contemplation, being gentle.

source: སྒྲུབ་པ་གང་ཡིན་རུང་བའི་ཚོད་ཤེས་པ། །
en: Accomplishment, knowing appropriate limits.

source: རྩོམ་པ་ལྷག་པའི་ཚུལ་ཁྲིམས་སློབ་ཅེས་བྱ། །
en: “ ‘Endeavor is training in higher discipline.

source: རྟུལ་བའི་ཚུལ་ཁྲིམས་ལྷོད་པ་མེད་པ་ཡིན། །
en: Commitment, not relaxing one’s discipline.

source: ལྷག་པའི་སེམས་སློབ་འདི་ནི་སོ་སོར་རྟོག །
en: Contemplation, training in higher motivation.

source: ལྷག་པའི་ཤེས་རབ་སློབ་པ་སྒྲུབ་པ་མཆོག །
en: Supreme accomplishment, training in higher insight.

source: རྩོམ་པ་སྦྱིན་དང་དེ་བཞིན་ཚུལ་ཁྲིམས་ཡིན། །
en: “ ‘Endeavor is generosity and discipline.

source: རྟུལ་བ་བཟོད་དང་དེ་བཞིན་བརྩོན་འགྲུས་སོ། །
en: Commitment, patience and diligence.

source: སོ་སོར་རྟོག་འདི་བསམ་གཏན་ཤེས་རབ་སྟེ། །
en: Contemplation, concentration and insight.

source: སྒྲུབ་པ་ཡེ་ཤེས་དང་ནི་དེ་བཞིན་ཐབས། །
en: Accomplishment, wisdom and means.

source: རྩོམ་པ་འཇིག་རྟེན་ཟང་ཟིང་ཆོས་སྦྱིན་པ། །
en: “ ‘Endeavor is giving material things and Dharma.

source: སྙན་པར་སྨྲ་བ་དེ་ནི་རྟུལ་བ་ཡིན། །
en: Commitment, speaking pleasantly.

source: དོན་དཔྱོད་གང་ཡིན་དེ་ནི་སོ་སོར་རྟོག །
en: Contemplation, acting meaningfully.

source: སྒྲུབ་པ་དོན་འཐུན་པ་སྟེ་སྙིང་པོ་ཡིན། །
en: The heart of accomplishment, being consistent with the meaning.

source: རྩོམ་པ་གང་ཡིན་བྱམས་པ་ཡོངས་སུ་དག །
en: “ ‘Endeavor is pure love.

source: རྟུལ་བ་དེ་ནི་སྙིང་རྗེ་ལྡན་པ་ཡིན། །
en: Commitment, having compassion.

source: དགའ་བ་ཆོས་ལ་སོ་སོར་རྟོག་པ་སྟེ། །
en: Contemplation is having joy for the Dharma.

source: བཏང་སྙོམས་ཡེ་ཤེས་སྒྲུབ་པར་བརྗོད་པ་ཡིན། །
en: Accomplishment of wisdom is equanimity.

source: རྩོམ་པ་ཞིང་ནི་རྣམ་པར་སྦྱོང་བ་སྟེ། །
en: “ ‘Endeavor is purification.

source: རྟུལ་བ་མཚན་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད། །
en: Commitment, perfecting the major marks of excellence.

source: སོ་སོར་རྟོག་པ་དམ་ཆོས་ཡོངས་སུ་འཛིན། །
en: Contemplation, upholding the sublime Dharma.

source: སྒྲུབ་པ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད། །
en: Accomplishment, ripening beings.

source: རྩོམ་པ་གང་ཡིན་ཕུང་པོ་བདུད་སེལ་བ། །
en: “ ‘Endeavor is eliminating the māra of the aggregates.

source: རྟུལ་བ་ཉོན་མོངས་བདུད་ནི་ཚར་གཅོད་པ། །
en: Commitment, destroying the māra of the afflictions.

source: སོ་སོར་རྟོག་པ་འཆི་བདག་ཚར་གཅོད་དེ། །
en: Contemplation, destroying the māra of the Lord of Death.

source: སྙིང་པོ་སྒྲུབ་པ་བདུད་ཀྱིས་ཅི་བྱར་ཡོད། །
en: With the essential accomplishment, what can the māras do?

source: རྩོམ་པ་སྡུག་བསྔལ་ཡོངས་སུ་ཤེས་པ་སྟེ། །
en: “ ‘Endeavor is understanding suffering.

source: སྲིད་པའི་གནས་མེད་འདི་ནི་རྟུལ་བ་ཡིན། །
en: Commitment, eliminating the basis of saṃsāra.

source: ལམ་སྒོམ་གང་ཡིན་དེ་ནི་སོ་སོར་རྟོག །
en: Contemplation, cultivating the path.

source: འགོག་པ་ཤེས་པ་སྒྲུབ་པར་བརྗོད་པ་ཡིན། །
en: Accomplishment, experiencing cessation.

source: རྩོམ་པ་ལུས་ལ་དྲན་པ་བཅིངས་པ་མེད། །
en: “ ‘Endeavor is mindfulness of the body, free from ties.

source: རྟུལ་བ་ཚོར་བ་ལ་ནི་ལྟ་བ་མེད། །
en: Commitment, not having views about sensations.

source: སེམས་ལ་དྲན་པ་འདི་ནི་སོ་སོར་རྟོག །
en: Contemplation, mindfulness of mind.

source: ཆོས་ལ་དྲན་པ་སྒྲུབ་པ་དམ་པ་ཡིན། །
en: Sublime accomplishment, mindfulness of phenomena.

source: རྩོམ་པ་དད་པའི་སྟོབས་དང་དེའི་དབང་པོ། །
en: “ ‘Endeavor is the strength and faculty of faith.

source: རྟུལ་བ་བརྩོན་འགྲུས་སྟོབས་དང་མཐུ་ཡིན་ཏེ། །
en: Commitment, the strength and might of diligence.

source: དྲན་དང་ཏིང་འཛིན་དབང་པོ་སོ་སོར་རྟོག །
en: Contemplation, the faculties of mindfulness and absorption.

source: ཤེས་རབ་དབང་པོ་སྒྲུབ་པར་བརྗོད་པ་ཡིན། །
en: Accomplishment, the faculty of insight.

source: རྩོམ་པ་མི་དགེ་རྣམ་པར་སྤོང་ཞེས་བརྗོད། །
en: “ ‘Endeavor is abandoning nonvirtues.

source: རྟུལ་བ་གང་ཡིན་དགེ་བ་ཆུད་མི་གསོན། །
en: Commitment, not wasting virtues.

source: ལུས་དང་སེམས་ཀྱང་གང་ཡིན་སོ་སོར་རྟོག །
en: Contemplation, refers to body and mind.

source: སྒྲུབ་པ་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་ཞེས་བརྗོད། །
en: Accomplishment, manifesting miracles.

source: རྩོམ་པ་མཁས་པ་བྱང་ཆུབ་ཡན་ལག་སྒོམ། །
en: “ ‘Endeavor is being learned and cultivating the branches of awakening.

source: རྟུལ་བ་གང་ཚེ་ལམ་ནི་རྟོག་པ་ཡིན། །
en: Commitment, realizing the path.

source: ཞི་གནས་ལྷག་མཐོང་དེ་ནི་སོ་སོར་རྟོག །
en: Contemplation, tranquility and special insight.

source: རིག་དང་རྣམ་གྲོལ་སྒྲུབ་པ་སྙིང་པོ་ཡིན། །
en: The essential accomplishment, insight and liberation.

source: རྩོམ་པ་འཇུག་པ་རྟུལ་བ་སྤྱོད་པ་ཡིན། །
en: “ ‘Endeavor is engagement; commitment, conduct.

source: སོ་སོར་རྟོག་པ་སེམས་ནི་རབ་སྦྱངས་པ། །
en: Contemplation is purifying the mind.

source: མཚན་མའི་སྤྱོད་ཡུལ་ཐམས་ཅད་གང་ལོག་པ། །དེ་ནི་སྒྲུབ་པའི་ཚུལ་དུ་བརྗོད་པ་ཡིན། །
en: Reversing all experience related to signs Is described as the way of accomplishment.

source: ལུས་དང་སེམས་ནི་རབ་ཏུ་སྦྱངས་པ་དང་། །རྒྱུ་དང་ལྟ་ལས་རབ་ཏུ་འདའ་བ་དང་། །མིང་དང་གཟུགས་ནི་ཡོངས་སུ་གང་ཤེས་པ། །དེ་ནི་བརྩོན་འགྲུས་མཆོག་ཅེས་འཕགས་པས་བསྔགས། །
en: Achieving pliancy of body and mind, Transcending causation and views, And understanding name and form. “ ‘The noble ones praise supreme diligence as

source: ང་དང་ང་ཡི་ཞེས་པ་ནམ་འགག་པ། །དེ་ཚེ་བཅིངས་པ་ཀུན་ལས་རྣམ་པར་གྲོལ། །ཀུན་ནས་ལྡང་མེད་སྒྲིབ་པ་ལྔ་ལས་གྲོལ། །
en: “ ‘When “I” and “mine” are put to a stop, Then one is liberated from all bondage, Origination is eliminated, and one is free from the five obscurations.

source: མཁས་པ་ཐེ་ཚོམ་དང་ནི་འགྱོད་པ་སྤངས། །
en: The learned will discard all doubt and regret.

source: མདུད་པ་རྣམས་དང་ཟུག་རྔུ་བསལ་བ་གང་། །སྒྲིབ་པ་མེད་ཅིང་རྒྱུན་ཆད་ཡོད་པ་མིན། །ང་རྒྱལ་མངོན་པའི་ང་རྒྱལ་གང་ཚེ་སྤངས། །དེ་ཚེ་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་ལས་བྱས་ཡིན། །
en: “ ‘When all knots and pain are lost, When there are no obscurations or upheavals, When pride and manifest pride are discarded, This is a function of diligence’s power.

source: མཚན་མ་ཐམས་ཅད་སེལ་བ་གང་ཡིན་དང་། །སྤྲོས་པ་ཐམས་ཅད་འཇུག་པ་མེད་པ་དང་། །ཉོན་མོངས་ཐམས་ཅད་སྤོང་བ་གང་ཡིན་པ། །བརྩོན་འགྲུས་དེ་ནི་མཁས་པ་རྣམས་ཀྱིས་བསྔགས། །
en: “ ‘The learned praise diligence as being The elimination of all signs, Disengaging from all elaborations, And discarding all afflictions.’

source: བརྩོན་འགྲུས་འབར་བས་རབ་ཏུ་བསྔགས་པའི་ཚེ། །བརྩོན་འགྲུས་ཡོན་ཏན་འདི་དག་ཐོས་ནས་ནི། །གྲགས་པ་ཆེན་པོ་སྟོང་ཕྲག་བཅུ་ཀུན་གྱིས། །མི་སྐྱེའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར། །
en: “When they heard the qualities of diligence As extolled by Dīptavīrya, Ten thousand glorious ones Achieved acceptance of the unborn.

source: འདི་ཐོས་ནས་ནི་སྟོང་ཕྲག་ལྔ་ཞིག་ཀྱང་། །སངས་རྒྱས་ཞིང་འདིར་བཟོད་པ་རྣམ་པར་སྦྱངས། །
en: “Having heard this teaching, five thousand beings Trained in patience in that buddha realm.

source: མི་དང་ལྷ་དང་ལྷ་མིན་མིའམ་ཅི། །བདུན་སྟོང་བྱང་ཆུབ་མཆོག་ལ་རབ་ཏུ་ཞུགས། །
en: Seven thousand humans, gods, asuras, and kinnaras Set forth toward supreme awakening.

source: དེ་ན་གང་གིས་བརྩོན་འགྲུས་མཆོག་རེག་པ། །དགེ་སློང་བརྩོན་འགྲུས་བརྟན་པ་ང་ཡིན་ཏེ། །
en: “Back then, it was I who was that monk of stable diligence, The one who had reached supreme diligence.

source: བརྩོན་འགྲུས་བརྩམས་ནས་ངས་ནི་ལུས་བཏང་སྟེ། །འདུག་བཞིན་དེ་ཚེ་འཆི་བའི་དུས་བྱས་གྱུར། །
en: Practicing diligence, I relinquished my body, And thus, I passed away from that existence.

source: བརྒྱད་ཁྲི་ལས་ནི་བཞི་སྟོང་ལྷག་པ་ལ། །བདག་གིས་ལུས་ནི་རབ་ཏུ་སྐམས་པར་བྱས། །
en: “More than eighty-four thousand times I let this body wither.

source: བསྐལ་པ་གཅིག་ལ་འདྲེན་པ་མཉེས་བྱས་ཏེ། །བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་བསྙིལ་ཏོ། །
en: For an eon, I pleased a guide And distinguished myself from other bodhisattvas.”

source: བརྩོན་འགྲུས་བརྩམས་པའི་ལེའུ་སྟེ་ལྔ་པའོ།། །།
en: [Chapter Five: Practicing Diligence]

source: དེ་ནས་ཚངས་པ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then, Mahābrahmā Great Compassionate One asked the bodhisattva great being Sāgaramati,

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་
en: “Noble son, what does the term qualities of buddhahood refer to?”

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་ཚངས་པ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Bodhisattva Sāgaramati responded,

source: ཚངས་པ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: “Brahmā, ‘the qualities of buddhahood’ refers to all phenomena.

source: ཚངས་པ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་ཆད་པའི་རྣམ་པས་ཚད་དང་ལྡན་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་མ་ཡིན་གྱི།
en: Brahmā, a thus-gone one does not awaken to perfect buddhahood in a restricted and limited manner.

source: དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མ་ཆད་པའི་རྣམ་པས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་རྣམ་པས་ཚད་མེད་པར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Rather, a thus-gone one awakens to perfect buddhahood in an unrestricted and unlimited manner due to realizing the sameness of all phenomena.

source: ཚངས་པ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ་ནི་བྱང་ཆུབ་སྟེ།
en: Brahmā, realizing all phenomena to be sameness is awakening.

source: ཚངས་པ་དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱའོ། །
en: Therefore, Brahmā, all phenomena are qualities of buddhahood.

source: ཚངས་པ་ཆོས་ཐམས་ཅད་ཅི་འདྲ་བའི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་དེ་འདྲ་བ་ཉིད་དོ། །
en: Brahmā, all phenomena are precisely the qualities of buddhahood.

source: ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དོ། །
en: The essence of all phenomena is the essence of all the qualities of buddhahood.

source: ཆོས་ཐམས་ཅད་དབེན་པ་ཉིད་པས་སངས་རྒྱས་ཀྱི་ཆོས་དབེན་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: The qualities of buddhahood are realized to be disengaged because all phenomena are disengaged.
